# Notes 2023-03-02

In [102]:
import pandas as pd

In [103]:
url = "https://docs.google.com/spreadsheets/d/1VVw6O5ncoc2R-bBvu1Xc0PqylA6tKW2pyh5bDHhE_r8"
dfs = pd.read_excel(f'{url}/export?format=xlsx', sheet_name=None)

In [104]:
dfs.keys()

dict_keys(['person', 'site', 'survey', 'visited'])

In [59]:
dfs['person']

         id   personal    family
0      dyer    William      Dyer
1        pb      Frank   Pabodie
2      lake   Anderson      Lake
3       roe  Valentina   Roerich
4  danforth      Frank  Danforth

In [60]:
dfs['site']

    name    lat    long
0   DR-1 -49.85 -128.57
1   DR-3 -47.15 -126.72
2  MSK-4 -48.87 -123.40

In [61]:
dfs['survey']

    taken person quant  reading
0     619   dyer   rad     9.82
1     619   dyer   sal     0.13
2     622   dyer   rad     7.80
3     622   dyer   sal     0.09
4     734     pb   rad     8.41
5     734   lake   sal     0.05
6     734     pb  temp   -21.50
7     735     pb   rad     7.22
8     735    NaN   sal     0.06
9     735    NaN  temp   -26.00
10    751     pb   rad     4.35
11    751     pb  temp   -18.50
12    751   lake   sal     0.10
13    752   lake   rad     2.19
14    752   lake   sal     0.09
15    752   lake  temp   -16.00
16    752    roe   sal    41.60
17    837   lake   rad     1.46
18    837   lake   sal     0.21
19    837    roe   sal    22.50
20    844    roe   rad    11.25

In [62]:
dfs['visited']

    id   site      dated
0  619   DR-1 1927-02-08
1  622   DR-1 1927-02-10
2  734   DR-3 1930-01-07
3  735   DR-3 1930-01-12
4  751   DR-3 1930-02-26
5  752   DR-3        NaT
6  837  MSK-4 1932-01-14
7  844   DR-1 1932-03-22

## Asking questions on data

###  Selecting a column (series)

In [105]:
dfs['person']['family']

0        Dyer
1     Pabodie
2        Lake
3     Roerich
4    Danforth
Name: family, dtype: object

### as a dataframe

In [64]:
dfs['person'][['family']]

     family
0      Dyer
1   Pabodie
2      Lake
3   Roerich
4  Danforth

### multiple columns

In [65]:
dfs['person'][['personal', 'family']]

    personal    family
0    William      Dyer
1      Frank   Pabodie
2   Anderson      Lake
3  Valentina   Roerich
4      Frank  Danforth

In [66]:
dfs['survey']

    taken person quant  reading
0     619   dyer   rad     9.82
1     619   dyer   sal     0.13
2     622   dyer   rad     7.80
3     622   dyer   sal     0.09
4     734     pb   rad     8.41
5     734   lake   sal     0.05
6     734     pb  temp   -21.50
7     735     pb   rad     7.22
8     735    NaN   sal     0.06
9     735    NaN  temp   -26.00
10    751     pb   rad     4.35
11    751     pb  temp   -18.50
12    751   lake   sal     0.10
13    752   lake   rad     2.19
14    752   lake   sal     0.09
15    752   lake  temp   -16.00
16    752    roe   sal    41.60
17    837   lake   rad     1.46
18    837   lake   sal     0.21
19    837    roe   sal    22.50
20    844    roe   rad    11.25

### Unique values

What type of measurement do we have? Unique names

In [67]:
dfs['survey']['quant']

0      rad
1      sal
2      rad
3      sal
4      rad
5      sal
6     temp
7      rad
8      sal
9     temp
10     rad
11    temp
12     sal
13     rad
14     sal
15    temp
16     sal
17     rad
18     sal
19     sal
20     rad
Name: quant, dtype: object

In [68]:
set(dfs['survey']['quant'])

{'rad', 'sal', 'temp'}

In [69]:
dfs['survey']['quant'].unique()

array(['rad', 'sal', 'temp'], dtype=object)

How many times to the values appear?

In [70]:
dfs['survey']['quant'].value_counts()

sal     9
rad     8
temp    4
Name: quant, dtype: int64

## Sorting values

In [71]:
dfs['person']

         id   personal    family
0      dyer    William      Dyer
1        pb      Frank   Pabodie
2      lake   Anderson      Lake
3       roe  Valentina   Roerich
4  danforth      Frank  Danforth

### Sort on elements in a column

In [72]:
dfs['person'].sort_values('personal')

         id   personal    family
2      lake   Anderson      Lake
1        pb      Frank   Pabodie
4  danforth      Frank  Danforth
3       roe  Valentina   Roerich
0      dyer    William      Dyer

### Sorting on multiple columns in priority order

In [108]:
dfs['person'].sort_values(['personal', 'family'])

         id   personal    family
2      lake   Anderson      Lake
4  danforth      Frank  Danforth
1        pb      Frank   Pabodie
3       roe  Valentina   Roerich
0      dyer    William      Dyer

## Filtering

In [74]:
dfs['site']

    name    lat    long
0   DR-1 -49.85 -128.57
1   DR-3 -47.15 -126.72
2  MSK-4 -48.87 -123.40

In [75]:
dfs['site']['name'] == 'DR-1'

0     True
1    False
2    False
Name: name, dtype: bool

In [76]:
dfs['site'][dfs['site']['name'] == 'DR-1']

   name    lat    long
0  DR-1 -49.85 -128.57

#### Logical operations

Use a logical OR operation (in Pandas this is |, the AND operation is &)

In [109]:
dfs['site'][(dfs['site']['name'] == 'DR-1') | (dfs['site']['name'] == 'DR-3')]

   name    lat    long
0  DR-1 -49.85 -128.57
1  DR-3 -47.15 -126.72

Filter all rows where name starts with 'DR-'

In [110]:
dfs['site']['name'].str.startswith('DR-')

0     True
1     True
2    False
Name: name, dtype: bool

In [79]:
dfs['site'][dfs['site']['name'].str.startswith('DR-')]

   name    lat    long
0  DR-1 -49.85 -128.57
1  DR-3 -47.15 -126.72

Exercise: write an expression that returns rows where sal is outsite the range [0, 1]

In [80]:
dfs['survey']

    taken person quant  reading
0     619   dyer   rad     9.82
1     619   dyer   sal     0.13
2     622   dyer   rad     7.80
3     622   dyer   sal     0.09
4     734     pb   rad     8.41
5     734   lake   sal     0.05
6     734     pb  temp   -21.50
7     735     pb   rad     7.22
8     735    NaN   sal     0.06
9     735    NaN  temp   -26.00
10    751     pb   rad     4.35
11    751     pb  temp   -18.50
12    751   lake   sal     0.10
13    752   lake   rad     2.19
14    752   lake   sal     0.09
15    752   lake  temp   -16.00
16    752    roe   sal    41.60
17    837   lake   rad     1.46
18    837   lake   sal     0.21
19    837    roe   sal    22.50
20    844    roe   rad    11.25

In [81]:
gt1 = dfs['survey'][dfs['survey']['quant'] == 'sal']['reading'] > 1

In [82]:
gt1

1     False
3     False
5     False
8     False
12    False
14    False
16     True
18    False
19     True
Name: reading, dtype: bool

We may be expecting the following output with `dfs['survey'][gt1]` but this did not work as expected. This array does not have all the indixes from the original dataframe.

In [83]:
# dfs['survey'][gt1] does not work
dfs['survey'].loc[[16, 19], :]

    taken person quant  reading
16    752    roe   sal     41.6
19    837    roe   sal     22.5

One would rather filter them simultaneously

In [115]:
dfs['survey'][(dfs['survey']['quant'] == 'sal') & (dfs['survey']['reading'] > 1)]

    taken person quant  reading
16    752    roe   sal     41.6
19    837    roe   sal     22.5

## Transforming and adding data

In [87]:
dfs['survey'][dfs['survey']['quant'] == 'temp']['reading']

6    -21.5
9    -26.0
11   -18.5
15   -16.0
Name: reading, dtype: float64

In [88]:
dfs['survey'][dfs['survey']['quant'] == 'temp']['reading']*1.8 + 32

6     -6.7
9    -14.8
11    -1.3
15     3.2
Name: reading, dtype: float64

In [89]:
dfs['survey']['temp_F'] = dfs['survey'][dfs['survey']['quant'] == 'temp']['reading']*1.8 + 32

In [90]:
dfs['survey']

    taken person quant  reading  temp_F
0     619   dyer   rad     9.82     NaN
1     619   dyer   sal     0.13     NaN
2     622   dyer   rad     7.80     NaN
3     622   dyer   sal     0.09     NaN
4     734     pb   rad     8.41     NaN
5     734   lake   sal     0.05     NaN
6     734     pb  temp   -21.50    -6.7
7     735     pb   rad     7.22     NaN
8     735    NaN   sal     0.06     NaN
9     735    NaN  temp   -26.00   -14.8
10    751     pb   rad     4.35     NaN
11    751     pb  temp   -18.50    -1.3
12    751   lake   sal     0.10     NaN
13    752   lake   rad     2.19     NaN
14    752   lake   sal     0.09     NaN
15    752   lake  temp   -16.00     3.2
16    752    roe   sal    41.60     NaN
17    837   lake   rad     1.46     NaN
18    837   lake   sal     0.21     NaN
19    837    roe   sal    22.50     NaN
20    844    roe   rad    11.25     NaN

Group by operations: what is the average value measure per quantity and person?

In [93]:
dfs['survey']['reading']

0      9.82
1      0.13
2      7.80
3      0.09
4      8.41
5      0.05
6    -21.50
7      7.22
8      0.06
9    -26.00
10     4.35
11   -18.50
12     0.10
13     2.19
14     0.09
15   -16.00
16    41.60
17     1.46
18     0.21
19    22.50
20    11.25
Name: reading, dtype: float64

In [99]:
dfs['survey'].groupby('quant')['reading'].mean()

quant
rad      6.562500
sal      7.203333
temp   -20.500000
Name: reading, dtype: float64

In [100]:
dfs['survey'].groupby(['person', 'quant'])['reading'].mean()

person  quant
dyer    rad       8.8100
        sal       0.1100
lake    rad       1.8250
        sal       0.1125
        temp    -16.0000
pb      rad       6.6600
        temp    -20.0000
roe     rad      11.2500
        sal      32.0500
Name: reading, dtype: float64